stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_hal_adc.h
  uint32_t    FractionalInterpolator;         /*!< Specify whether fractional interpolator is enabled or disabled.
                                                   This parameter can be set to ENABLE or DISABLE. */

  uint32_t    CICFilterDecimatorHalfFactor;   /*!< Specify if the decimator factor of the CIC filter is using integer or
                                                   half.
                                                   Note: this bit must be set only for the generation of a data rate at
                                                   44.1 kps from ADC data at 1 MHz. Unpredictable result may happen if
                                                   set for other configuration.
                                                   This parameter can be a value of
                                                   @ref ADC_HAL_CIC_DECIMATOR_HALF_FACTOR. */

  uint32_t    MCICOutputFrequency;            /*!< Specify the output frequency of the CIC filter.
                                                   This parameter can be a value of @ref ADC_HAL_MICROPHONE_OUT_FREQ. */

} ADC_DFConfTypeDef;

/**
  * @brief Structure definition with the setting for the Pulse Density Modulation (PDM)
  */
typedef struct
{
  uint32_t ClockDivider;              /*!< Specify the clock divider for the (PDM) Interface.
                                           This parameter can be a value of @ref ADC_HAL_PDM_CLK_DIVIDER. */
} ADC_PDMConfTypeDef;

/**
  * @brief Structure definition with the setting for the Pulse Density Modulation (PDM)
  */
typedef struct
{
  uint32_t Bias;                      /*!< Specify the bias voltage (offset) for the Programmable Gain Amplifier (PGA).
                                           This parameter can be a value of @ref ADC_HAL_PGA_BIAS. */

  uint32_t Gain;                      /*!< Specify the gain for the Programmable Gain Amplifier (PGA).
                                           This parameter can be a value of @ref ADC_HAL_PGA_GAIN. */

} ADC_PGAConfTypeDef;

/**
  * @brief Structure definition with common setting for the ADC.
  */
typedef struct
{
  uint32_t    ConversionType;          /*!< Specifies the conversion type: through the Down Sampler (DS) or
                                            through the Decimation Filter (DF).
                                            This parameter can be a value of @ref ADC_HAL_CONVERSION_TYPE. */

  FunctionalState ContinuousConvMode;  /*!< Specify whether the conversion is performed in single mode (one conversion)
                                            or continuous mode for ADC group regular, after the first ADC conversion
                                            start trigger occurred (software start or external trigger). This parameter
                                            can be set to ENABLE or DISABLE. */

  uint32_t    SequenceLength;          /*!< Specify the length of the conversion sequence.
                                            This parameter must be a number between Min_Data = 1 and
                                            Max_Data = 16. */

  uint32_t    SamplingMode;            /*!< Specifies the input sampling mode.
                                            This parameter can be a value of @ref ADC_HAL_SAMPLING_METHOD. */

  uint32_t    SampleRate;              /*!< Specify the ADC sample rate.
                                            This parameter can be a value of @ref ADC_HAL_SAMPLE_RATE.     */

  ADC_DSConfTypeDef DownSamplerConfig; /*!< Specifies the Down Sampler parameters. */

  uint32_t    InvertOutputMode;        /*!< Specifies the bit to bit inversion (1' complement) for
                                            differential input and/or single negative input.
                                            This parameter can be a value of @ref ADC_HAL_DATA_INVERT.   */

  uint32_t    Overrun;                 /*!< Specifies the overrung policy applied to the data.
                                            This parameter can be a value of @ref ADC_HAL_OVERRUN_CONFIG.  */


} ADC_InitTypeDef;

/**
  * @brief  ADC handle Structure definition
  */
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
typedef struct __ADC_HandleTypeDef
#else
typedef struct
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
{
  ADC_TypeDef        *Instance;    /*!< Register base address */
  ADC_InitTypeDef    Init;         /*!< Parameters for ADC initialization */

  DMA_HandleTypeDef  *DMA_Handle;  /*!< Pointer DMA Handler */

  HAL_LockTypeDef    Lock;         /*!< ADC locking object */
  __IO uint32_t      State;        /*!< ADC communication state (bitmap of ADC states) */
  __IO uint32_t      ErrorCode;    /*!< ADC Error code */

#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
  void (* ConvCpltCallback)(struct __ADC_HandleTypeDef *hadc);         /*!< ADC conversion complete callback */
  void (* ConvHalfCpltCallback)(struct __ADC_HandleTypeDef *hadc);     /*!< ADC conversion DMA half-transfer callback */
  void (* LevelOutOfWindowCallback)(struct __ADC_HandleTypeDef *hadc); /*!< ADC analog watchdog 1 callback */
  void (* ErrorCallback)(struct __ADC_HandleTypeDef *hadc);            /*!< ADC error callback */
  void (* MspInitCallback)(struct __ADC_HandleTypeDef *hadc);          /*!< ADC Msp Init callback */
  void (* MspDeInitCallback)(struct __ADC_HandleTypeDef *hadc);        /*!< ADC Msp DeInit callback */
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */

} ADC_HandleTypeDef;


#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
/**
  * @brief  HAL ADC Callback ID enumeration definition
  */
typedef enum
{
  HAL_ADC_CONVERSION_COMPLETE_CB_ID     = 0x00U,  /*!< ADC conversion complete callback ID          */
  HAL_ADC_CONVERSION_HALF_CB_ID         = 0x01U,  /*!< ADC conversion DMA half-transfer callback ID */
  HAL_ADC_LEVEL_OUT_OF_WINDOW_1_CB_ID   = 0x02U,  /*!< ADC watchdog callback ID                 */
  HAL_ADC_ERROR_CB_ID                   = 0x03U,  /*!< ADC error callback ID                        */
  HAL_ADC_MSPINIT_CB_ID                 = 0x09U,  /*!< ADC Msp Init callback ID                     */
  HAL_ADC_MSPDEINIT_CB_ID               = 0x0AU   /*!< ADC Msp DeInit callback ID                   */
} HAL_ADC_CallbackIDTypeDef;

/**
  * @brief  HAL ADC Callback pointer definition
  */
typedef  void (*pADC_CallbackTypeDef)(ADC_HandleTypeDef *hadc); /*!< pointer to a ADC callback function */

#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */

/**
  * @}
  */


/* Exported constants --------------------------------------------------------*/

/** @defgroup ADC_Exported_Constants ADC Exported Constants
  * @{
  */

/** @defgroup ADC_States ADC States
  * @{
  */

/**
  * @brief  HAL ADC state machine: ADC states definition (bitfields)
  * @note   ADC state machine is managed by bitfields, state must be compared
  *         with bit by bit.
  *         For example:
  *           " if ((HAL_ADC_GetState(hadc) & HAL_ADC_STATEBUSY) != 0UL) "
  *           " if ((HAL_ADC_GetState(hadc) & HAL_ADC_STATE_AWD1) != 0UL) "
  */
/* States of ADC global scope */
#define HAL_ADC_STATE_RESET           (0x00000000UL)   /*!< ADC not yet initialized or disabled */
#define HAL_ADC_STATE_READY           (0x00000001UL)   /*!< ADC peripheral ready to use         */
#define HAL_ADC_STATE_BUSY_INTERNAL   (0x00000002UL)   /*!< ADC is busy due to an internal process (initialization, calibration) */
#define HAL_ADC_STATE_TIMEOUT         (0x00000004UL)   /*!< TimeOut occurrence                  */

/* States of ADC errors */
#define HAL_ADC_STATE_ERROR_INTERNAL  (0x00000010UL)   /*!< Internal error occurrence      */
#define HAL_ADC_STATE_ERROR_CONFIG    (0x00000020UL)   /*!< Configuration error occurrence */
#define HAL_ADC_STATE_ERROR_DMA       (0x00000040UL)   /*!< DMA error occurrence           */

