stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_hal_adc.h
/* States of ADC conversion */
#define HAL_ADC_STATE_DS_BUSY         (0x00000100UL)   /*!< A conversion on down sampler data path is ongoing or can
                                                            occur */
#define HAL_ADC_STATE_DS_EOC          (0x00000200UL)   /*!< Converted data available in downsampler data register     */
#define HAL_ADC_STATE_DS_OVR          (0x00000400UL)   /*!< Overrun on down sampler data path occurrence              */

#define HAL_ADC_STATE_DF_BUSY         (0x00001000UL)   /*!< A conversion on decimation filter path is ongoing or can
                                                            occur */
#define HAL_ADC_STATE_DF_EOC          (0x00002000UL)   /*!< Converted data available in decimation filter data
                                                            register */
#define HAL_ADC_STATE_DF_OVR          (0x00000400UL)   /*!< Overrun occurrence in decimation filter data              */

/* States of ADC analog watchdog */
#define HAL_ADC_STATE_AWD1            (0x00010000UL)   /*!< Out-of-window occurrence of ADC analog watchdog */

/**
  * @}
  */


/** @defgroup ADC_Error_Code ADC Error Code
  * @{
  */

#define HAL_ADC_ERROR_NONE            (0x00U)   /*!< No error               */
#define HAL_ADC_ERROR_INTERNAL        (0x01U)   /*!< Internal error         */
#define HAL_ADC_ERROR_OVR             (0x02U)   /*!< Data overrun error     */
#define HAL_ADC_ERROR_DMA             (0x04U)   /*!< DMA transfer error     */

#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
#define HAL_ADC_ERROR_INVALID_CALLBACK  (0x10U) /*!< Invalid Callback error */
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */

/**
  * @}
  */

#define ADC_DEFAULT_LDO_DELAY_US         (160UL)      /*!< Default delay for LDO stabilization (uS)*/
#define ADC_DEFAULT_VBIAS_PRECH_DELAY_US (600UL)      /*!< Default delay for the VBIAS precharge pulse duration (uS)*/

/** @defgroup ADC_HAL_CH_NUM_CODE ADC channel number code for conversion definitions
  * @{
  */

#define ADC_CHANNEL_VINM0            (LL_ADC_CHANNEL_VINM0)        /*!< ADC channel for VINM0 to single negative input */
#define ADC_CHANNEL_VINM1            (LL_ADC_CHANNEL_VINM1)        /*!< ADC channel for VINM1 to single negative input */
#define ADC_CHANNEL_VINM2            (LL_ADC_CHANNEL_VINM2)        /*!< ADC channel for VINM2 to single negative input */
#define ADC_CHANNEL_VINM3            (LL_ADC_CHANNEL_VINM3)        /*!< ADC channel for VINM3 to single negative input */
#define ADC_CHANNEL_VINP0            (LL_ADC_CHANNEL_VINP0)        /*!< ADC channel for VINP0 to single positive input */
#define ADC_CHANNEL_VINP1            (LL_ADC_CHANNEL_VINP1)        /*!< ADC channel for VINP1 to single positive input */
#define ADC_CHANNEL_VINP2            (LL_ADC_CHANNEL_VINP2)        /*!< ADC channel for VINP2 to single positive input */
#define ADC_CHANNEL_VINP3            (LL_ADC_CHANNEL_VINP3)        /*!< ADC channel for VINP3 to single positive input */
#define ADC_CHANNEL_VINP0_VINM0      (LL_ADC_CHANNEL_VINP0_VINM0)  /*!< ADC channel for VINP0 - VINM0 to differential input */
#define ADC_CHANNEL_VINP1_VINM1      (LL_ADC_CHANNEL_VINP1_VINM1)  /*!< ADC channel for VINP1 - VINM1 to differential input */
#define ADC_CHANNEL_VINP2_VINM2      (LL_ADC_CHANNEL_VINP2_VINM2)  /*!< ADC channel for VINP2 - VINM2 to differential input */
#define ADC_CHANNEL_VINP3_VINM3      (LL_ADC_CHANNEL_VINP3_VINM3)  /*!< ADC channel for VINP3 - VINM3 to differential input */
#define ADC_CHANNEL_VBAT             (LL_ADC_CHANNEL_VBAT)         /*!< ADC channel for VBAT, battery level detector        */
#define ADC_CHANNEL_TEMPSENSOR       (LL_ADC_CHANNEL_TEMPSENSOR)   /*!< ADC channel for temperature sensor                  */

/**
  * @}
  */

/** @defgroup ADC_HAL_SAMPLING_METHOD  ADC input sampling method definitions
  * @{
  */

#define ADC_SAMPLING_AT_START    (LL_ADC_SAMPLING_AT_START)  /*!< Sampling phase starts only at conversion start and
                                                                  sampling time is 125ns regardless of the sampling
                                                                  period (default). */
#define ADC_SAMPLING_AT_END      (LL_ADC_SAMPLING_AT_END)    /*!< Sampling phase starts after end of
                                                                  conversion, and stops upon trigger event (Also known
                                                                  as Bulb sampling mode).
                                                                  Sampling time is a function of the sampling period
                                                                  (Sample rate). */

/**
  * @}
  */


/** @defgroup ADC_HAL_OVERRUN_CONFIG ADC overrun configuration definitions
  * @{
  */
#define ADC_NEW_DATA_IS_LOST    (LL_ADC_NEW_DATA_IS_LOST)        /*!< Previous data is preserved, new data is lost.   */
#define ADC_NEW_DATA_IS_KEPT    (LL_ADC_NEW_DATA_IS_KEPT)        /*!< Previous data is overwritten, new data is kept. */

/**
  * @}
  */


/** @defgroup ADC_HAL_DATA_INVERT ADC invert bit to bit data output for differential or
  *           single negative input (1' complement) definitions
  * @{
  */

#define ADC_DATA_INVERT_NONE  (0x00UL)    /*!< No inversion                             */
#define ADC_DATA_INVERT_DIFF  (0x01UL)    /*!< Inversion only for differential input    */
#define ADC_DATA_INVERT_SING  (0x02UL)    /*!< Inversion only for single negative input */
#define ADC_DATA_INVERT_BOTH  (0x03UL)    /*!< Inversion for both input type            */

/**
  * @}
  */

/** @defgroup ADC_HAL_CONVERSION_TYPE ADC conversion type definitions
  * @{
  */

#define ADC_CONVERSION_WITH_DS  (0x00UL)    /*!< ADC conversion through the Down Sampler (DS)      */
#define ADC_CONVERSION_WITH_DF  (0x01UL)    /*!< ADC conversion through the Decimation Filter (DF) */

/**
  * @}
  */

/** @defgroup ADC_HAL_SAMPLE_RATE ADC sample rate definitions
  * @{
  */
#define ADC_SAMPLE_RATE_16    (LL_ADC_SAMPLE_RATE_16)                     /*!< ADC conversion rate at F_ADC_CLK /  16 */
#define ADC_SAMPLE_RATE_20    (LL_ADC_SAMPLE_RATE_20)                     /*!< ADC conversion rate at F_ADC_CLK /  20 */
#define ADC_SAMPLE_RATE_24    (LL_ADC_SAMPLE_RATE_24)                     /*!< ADC conversion rate at F_ADC_CLK /  24 */
#define ADC_SAMPLE_RATE_28    (LL_ADC_SAMPLE_RATE_28)                     /*!< ADC conversion rate at F_ADC_CLK /  28 */
#if defined(ADC_CONF_SAMPLE_RATE_MSB)
#define ADC_SAMPLE_RATE_32    (LL_ADC_SAMPLE_RATE_32)                     /*!< ADC conversion rate at F_ADC_CLK /  32 */
#define ADC_SAMPLE_RATE_36    (LL_ADC_SAMPLE_RATE_36)                     /*!< ADC conversion rate at F_ADC_CLK /  36 */
#define ADC_SAMPLE_RATE_40    (LL_ADC_SAMPLE_RATE_40)                     /*!< ADC conversion rate at F_ADC_CLK /  40 */
#define ADC_SAMPLE_RATE_44    (LL_ADC_SAMPLE_RATE_44)                     /*!< ADC conversion rate at F_ADC_CLK /  44 */
#define ADC_SAMPLE_RATE_48    (LL_ADC_SAMPLE_RATE_48)                     /*!< ADC conversion rate at F_ADC_CLK /  48 */
#define ADC_SAMPLE_RATE_52    (LL_ADC_SAMPLE_RATE_52)                     /*!< ADC conversion rate at F_ADC_CLK /  52 */
#define ADC_SAMPLE_RATE_56    (LL_ADC_SAMPLE_RATE_56)                     /*!< ADC conversion rate at F_ADC_CLK /  56 */
#define ADC_SAMPLE_RATE_60    (LL_ADC_SAMPLE_RATE_60)                     /*!< ADC conversion rate at F_ADC_CLK /  60 */
#define ADC_SAMPLE_RATE_64    (LL_ADC_SAMPLE_RATE_64)                     /*!< ADC conversion rate at F_ADC_CLK /  64 */
#define ADC_SAMPLE_RATE_68    (LL_ADC_SAMPLE_RATE_68)                     /*!< ADC conversion rate at F_ADC_CLK /  68 */
#define ADC_SAMPLE_RATE_72    (LL_ADC_SAMPLE_RATE_72)                     /*!< ADC conversion rate at F_ADC_CLK /  72 */
#define ADC_SAMPLE_RATE_76    (LL_ADC_SAMPLE_RATE_76)                     /*!< ADC conversion rate at F_ADC_CLK /  76 */
#define ADC_SAMPLE_RATE_80    (LL_ADC_SAMPLE_RATE_80)                     /*!< ADC conversion rate at F_ADC_CLK /  80 */
#define ADC_SAMPLE_RATE_84    (LL_ADC_SAMPLE_RATE_84)                     /*!< ADC conversion rate at F_ADC_CLK /  84 */
#define ADC_SAMPLE_RATE_88    (LL_ADC_SAMPLE_RATE_88)                     /*!< ADC conversion rate at F_ADC_CLK /  88 */
#define ADC_SAMPLE_RATE_92    (LL_ADC_SAMPLE_RATE_92)                     /*!< ADC conversion rate at F_ADC_CLK /  92 */
#define ADC_SAMPLE_RATE_96    (LL_ADC_SAMPLE_RATE_96)                     /*!< ADC conversion rate at F_ADC_CLK /  96 */
#define ADC_SAMPLE_RATE_100   (LL_ADC_SAMPLE_RATE_100)                    /*!< ADC conversion rate at F_ADC_CLK / 100 */
#define ADC_SAMPLE_RATE_104   (LL_ADC_SAMPLE_RATE_104)                    /*!< ADC conversion rate at F_ADC_CLK / 104 */
#define ADC_SAMPLE_RATE_108   (LL_ADC_SAMPLE_RATE_108)                    /*!< ADC conversion rate at F_ADC_CLK / 108 */
#define ADC_SAMPLE_RATE_112   (LL_ADC_SAMPLE_RATE_112)                    /*!< ADC conversion rate at F_ADC_CLK / 112 */
#define ADC_SAMPLE_RATE_116   (LL_ADC_SAMPLE_RATE_116)                    /*!< ADC conversion rate at F_ADC_CLK / 116 */
#define ADC_SAMPLE_RATE_120   (LL_ADC_SAMPLE_RATE_120)                    /*!< ADC conversion rate at F_ADC_CLK / 120 */
#define ADC_SAMPLE_RATE_124   (LL_ADC_SAMPLE_RATE_124)                    /*!< ADC conversion rate at F_ADC_CLK / 124 */
#define ADC_SAMPLE_RATE_128   (LL_ADC_SAMPLE_RATE_128)                    /*!< ADC conversion rate at F_ADC_CLK / 128 */
#define ADC_SAMPLE_RATE_132   (LL_ADC_SAMPLE_RATE_132)                    /*!< ADC conversion rate at F_ADC_CLK / 132 */
#define ADC_SAMPLE_RATE_136   (LL_ADC_SAMPLE_RATE_136)                    /*!< ADC conversion rate at F_ADC_CLK / 136 */
#define ADC_SAMPLE_RATE_140   (LL_ADC_SAMPLE_RATE_140)                    /*!< ADC conversion rate at F_ADC_CLK / 140 */

#endif /* ADC_CONF_SAMPLE_RATE_MSB */
/**
  * @}
  */


