stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_hal_adc.h
/** @defgroup ADC_HAL_OP_MODE ADC operation modes definitions
  * @{
  */

#define ADC_OP_MODE_ADC      (LL_ADC_OP_MODE_ADC)    /*!< ADC operation mode ADC   */
#define ADC_OP_MODE_AUDIO    (LL_ADC_OP_MODE_AUDIO)  /*!< ADC operation mode AUDIO */
#define ADC_OP_MODE_FULL     (LL_ADC_OP_MODE_FULL)   /*!< ADC operation Full mode  */

/**
  * @}
  */

/** @defgroup ADC_HAL_EC_SEQ_RANKS  ADC Sequencer ranks
  * @{
  */

#define ADC_RANK_1                (LL_ADC_RANK_1)  /*!< ADC sequencer rank  1 */
#define ADC_RANK_2                (LL_ADC_RANK_2)  /*!< ADC sequencer rank  2 */
#define ADC_RANK_3                (LL_ADC_RANK_3)  /*!< ADC sequencer rank  3 */
#define ADC_RANK_4                (LL_ADC_RANK_4)  /*!< ADC sequencer rank  4 */
#define ADC_RANK_5                (LL_ADC_RANK_5)  /*!< ADC sequencer rank  5 */
#define ADC_RANK_6                (LL_ADC_RANK_6)  /*!< ADC sequencer rank  6 */
#define ADC_RANK_7                (LL_ADC_RANK_7)  /*!< ADC sequencer rank  7 */
#define ADC_RANK_8                (LL_ADC_RANK_8)  /*!< ADC sequencer rank  8 */
#define ADC_RANK_9                (LL_ADC_RANK_9)  /*!< ADC sequencer rank  9 */
#define ADC_RANK_10               (LL_ADC_RANK_10) /*!< ADC sequencer rank 10 */
#define ADC_RANK_11               (LL_ADC_RANK_11) /*!< ADC sequencer rank 11 */
#define ADC_RANK_12               (LL_ADC_RANK_12) /*!< ADC sequencer rank 12 */
#define ADC_RANK_13               (LL_ADC_RANK_13) /*!< ADC sequencer rank 13 */
#define ADC_RANK_14               (LL_ADC_RANK_14) /*!< ADC sequencer rank 14 */
#define ADC_RANK_15               (LL_ADC_RANK_15) /*!< ADC sequencer rank 15 */
#define ADC_RANK_16               (LL_ADC_RANK_16) /*!< ADC sequencer rank 16 */

/**
  * @}
  */

#if defined(ADC_SUPPORT_AUDIO_FEATURES)
/** @defgroup ADC_HAL_OCM_SOURCE ADC occasional mode source definitions
  * @{
  */

#define ADC_OCM_SRC_VBAT    (LL_ADC_OCM_SRC_VBAT)  /*!< ADC occasional mode source VBAT */
#define ADC_OCM_SRC_TEMP    (LL_ADC_OCM_SRC_TEMP)  /*!< ADC occasional mode source temperature sensor */

/**
  * @}
  */


/** @defgroup ADC_HAL_PGA_BIAS ADC microphone bias voltage definitions
  * @{
  */

#define ADC_PGA_BIAS_050_BAT   (LL_ADC_PGA_BIAS_050_BAT)  /*!< Set the microphone bias voltage at 0.50 V */
#define ADC_PGA_BIAS_055_BAT   (LL_ADC_PGA_BIAS_055_BAT)  /*!< Set the microphone bias voltage at 0.55 V */
#define ADC_PGA_BIAS_060_BAT   (LL_ADC_PGA_BIAS_060_BAT)  /*!< Set the microphone bias voltage at 0.60 V */
#define ADC_PGA_BIAS_065_BAT   (LL_ADC_PGA_BIAS_065_BAT)  /*!< Set the microphone bias voltage at 0.65 V */
#define ADC_PGA_BIAS_070_BAT   (LL_ADC_PGA_BIAS_070_BAT)  /*!< Set the microphone bias voltage at 0.70 V */
#define ADC_PGA_BIAS_075_BAT   (LL_ADC_PGA_BIAS_075_BAT)  /*!< Set the microphone bias voltage at 0.75 V */
#define ADC_PGA_BIAS_080_BAT   (LL_ADC_PGA_BIAS_080_BAT)  /*!< Set the microphone bias voltage at 0.80 V */
#define ADC_PGA_BIAS_090_BAT   (LL_ADC_PGA_BIAS_090_BAT)  /*!< Set the microphone bias voltage at 0.90 V */

/**
  * @}
  */


/** @defgroup ADC_HAL_PGA_GAIN ADC microphone gain definitions
  * @{
  */

#define ADC_PGA_GAIN_06_DB   (LL_ADC_PGA_GAIN_06_DB)  /*!< Set the microphone gain at 6 dB  */
#define ADC_PGA_GAIN_09_DB   (LL_ADC_PGA_GAIN_09_DB)  /*!< Set the microphone gain at 9 dB  */
#define ADC_PGA_GAIN_12_DB   (LL_ADC_PGA_GAIN_12_DB)  /*!< Set the microphone gain at 12 dB */
#define ADC_PGA_GAIN_15_DB   (LL_ADC_PGA_GAIN_15_DB)  /*!< Set the microphone gain at 15 dB */
#define ADC_PGA_GAIN_18_DB   (LL_ADC_PGA_GAIN_18_DB)  /*!< Set the microphone gain at 18 dB */
#define ADC_PGA_GAIN_21_DB   (LL_ADC_PGA_GAIN_21_DB)  /*!< Set the microphone gain at 21 dB */
#define ADC_PGA_GAIN_24_DB   (LL_ADC_PGA_GAIN_24_DB)  /*!< Set the microphone gain at 24 dB */
#define ADC_PGA_GAIN_27_DB   (LL_ADC_PGA_GAIN_27_DB)  /*!< Set the microphone gain at 27 dB */
#define ADC_PGA_GAIN_30_DB   (LL_ADC_PGA_GAIN_30_DB)  /*!< Set the microphone gain at 30 dB */
/**
  * @}
  */
#endif /* ADC_SUPPORT_AUDIO_FEATURES */

/** @defgroup ADC_HAL_INPUT_VOLTAGE_RANGE ADC input voltage range definitions
  * @{
  */

#define ADC_VIN_RANGE_1V2    (LL_ADC_VIN_RANGE_1V2)  /*!< ADC input voltage range up to 1.2 V */
#define ADC_VIN_RANGE_2V4    (LL_ADC_VIN_RANGE_2V4)  /*!< ADC input voltage range up to 2.4 V */
#define ADC_VIN_RANGE_3V6    (LL_ADC_VIN_RANGE_3V6)  /*!< ADC input voltage range up to 3.6 V */

/**
  * @}
  */


#if defined(ADC_SUPPORT_AUDIO_FEATURES)
/** @defgroup ADC_HAL_DF_DYN_RANGE ADC Decimation Filter dynamic range definitions
  * @{
  */

#define ADC_DF_DYN_RANGE_FULL    (LL_ADC_DF_DYN_RANGE_FULL)  /*!< ADC Decimation Filter dynamic full range */
#define ADC_DF_DYN_RANGE_HALF    (LL_ADC_DF_DYN_RANGE_HALF)  /*!< ADC Decimation Filter dynamic half range */

/**
  * @}
  */

/** @defgroup ADC_HAL_MIC_CHANNEL ADC microphone channel definitions
  * @{
  */

#define ADC_DF_MIC_CH_RIGHT    (LL_ADC_DF_MIC_CH_RIGHT) /*!< ADC microphone channel right */
#define ADC_DF_MIC_CH_LEFT     (LL_ADC_DF_MIC_CH_LEFT)  /*!< ADC microphone channel left  */

/**
  * @}
  */

/** @defgroup ADC_HAL_DF_DATA_FORMAT ADC data format definitions
  * @{
  */

#define ADC_DF_DATA_FORMAT_SIGNED    (LL_ADC_DF_DATA_FORMAT_SIGNED)    /*!< ADC data format signed   */
#define ADC_DF_DATA_FORMAT_UNSIGNED  (LL_ADC_DF_DATA_FORMAT_UNSIGNED)  /*!< ADC data format unsigned */

/**
  * @}
  */

/** @defgroup ADC_HAL_CIC_DECIMATOR_HALF_FACTOR ADC CIC decimator half factor definitions
  * @{
  */

#define ADC_DF_CIC_DECIMATOR_FACTOR_HALF     (LL_ADC_DF_CIC_DECIMATOR_FACTOR_HALF)    /*!< ADC DF CIC decimator factor half    */
#define ADC_DF_CIC_DECIMATOR_FACTOR_INTEGER  (LL_ADC_DF_CIC_DECIMATOR_FACTOR_INTEGER) /*!< ADC DF CIC decimator factor integer */

/**
  * @}
  */

/** @defgroup ADC_HAL_PDM_CLK_DIVIDER ADC PDM clock divider definitions
  * @{
  */

#define ADC_PDM_DIV_10   (LL_ADC_PDM_DIV_10)  /*!< ADC PDM clock divider 10 */
#define ADC_PDM_DIV_11   (LL_ADC_PDM_DIV_11)  /*!< ADC PDM clock divider 11 */
#define ADC_PDM_DIV_12   (LL_ADC_PDM_DIV_12)  /*!< ADC PDM clock divider 12 */
#define ADC_PDM_DIV_13   (LL_ADC_PDM_DIV_13)  /*!< ADC PDM clock divider 13 */
#define ADC_PDM_DIV_14   (LL_ADC_PDM_DIV_14)  /*!< ADC PDM clock divider 14 */
#define ADC_PDM_DIV_15   (LL_ADC_PDM_DIV_15)  /*!< ADC PDM clock divider 15 */
#define ADC_PDM_DIV_16   (LL_ADC_PDM_DIV_16)  /*!< ADC PDM clock divider 16 */
#define ADC_PDM_DIV_17   (LL_ADC_PDM_DIV_17)  /*!< ADC PDM clock divider 17 */
#define ADC_PDM_DIV_18   (LL_ADC_PDM_DIV_18)  /*!< ADC PDM clock divider 18 */
#define ADC_PDM_DIV_19   (LL_ADC_PDM_DIV_19)  /*!< ADC PDM clock divider 19 */
#define ADC_PDM_DIV_20   (LL_ADC_PDM_DIV_20)  /*!< ADC PDM clock divider 20 */
#define ADC_PDM_DIV_21   (LL_ADC_PDM_DIV_21)  /*!< ADC PDM clock divider 21 */
#define ADC_PDM_DIV_22   (LL_ADC_PDM_DIV_22)  /*!< ADC PDM clock divider 22 */
#define ADC_PDM_DIV_23   (LL_ADC_PDM_DIV_23)  /*!< ADC PDM clock divider 23 */
#define ADC_PDM_DIV_24   (LL_ADC_PDM_DIV_24)  /*!< ADC PDM clock divider 24 */
#define ADC_PDM_DIV_25   (LL_ADC_PDM_DIV_25)  /*!< ADC PDM clock divider 25 */

/**
  * @}
  */

/** @defgroup ADC_HAL_MICROPHONE_OUT_FREQ ADC microphone output frequency definitions
  * @{
  */
#define ADC_OUTPUT_FREQ_MIC_DIG_47619_HZ  (LL_ADC_OUTPUT_FREQ_MIC_DIG_47619_HZ)  /*!< ADC digital microphone output frequency 47.619 kHz */
#define ADC_OUTPUT_FREQ_MIC_DIG_44440_HZ  (LL_ADC_OUTPUT_FREQ_MIC_DIG_44440_HZ)  /*!< ADC digital microphone output frequency 44.44  kHz */
#define ADC_OUTPUT_FREQ_MIC_DIG_22220_HZ  (LL_ADC_OUTPUT_FREQ_MIC_DIG_22220_HZ)  /*!< ADC digital microphone output frequency 22.22  kHz */
#define ADC_OUTPUT_FREQ_MIC_DIG_15873_HZ  (LL_ADC_OUTPUT_FREQ_MIC_DIG_15873_HZ)  /*!< ADC digital microphone output frequency 15.873 kHz */
#define ADC_OUTPUT_FREQ_MIC_DIG_7936_HZ   (LL_ADC_OUTPUT_FREQ_MIC_DIG_7936_HZ)   /*!< ADC digital microphone output frequency 7.936  kHz */

#define ADC_OUTPUT_FREQ_MIC_ANA_200000_HZ (LL_ADC_OUTPUT_FREQ_MIC_ANA_200000_HZ)  /*!< ADC analog microphone output frequency 200.00 kHz */
#define ADC_OUTPUT_FREQ_MIC_ANA_15873_HZ  (LL_ADC_OUTPUT_FREQ_MIC_ANA_15873_HZ)   /*!< ADC analog microphone output frequency 15.873 kHz */
#define ADC_OUTPUT_FREQ_MIC_ANA_7936_HZ   (LL_ADC_OUTPUT_FREQ_MIC_ANA_7936_HZ)    /*!< ADC analog microphone output frequency 7.936  kHz */

/**
  * @}
  */
#endif /* ADC_SUPPORT_AUDIO_FEATURES */

