stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_hal_adc.h
/** @defgroup ADC_HAL_IRQ_ENABLE_MASK ADC IRQ_ENABLE register mask definitions
  * @{
  */
#if defined(ADC_SUPPORT_AUDIO_FEATURES)
#define ADC_IRQ_EN_MASK      (ADC_IRQ_EN_OVRFL | \
                              ADC_IRQ_EN_OVRDF | \
                              ADC_IRQ_EN_OVRDS | \
                              ADC_IRQ_EN_AWD1  | \
                              ADC_IRQ_EN_EOS   | \
                              ADC_IRQ_EN_EOC   | \
                              ADC_IRQ_EN_EODF  | \
                              ADC_IRQ_EN_EODS)
#else
#define ADC_IRQ_EN_MASK      (ADC_IRQ_EN_OVRDS | \
                              ADC_IRQ_EN_AWD1  | \
                              ADC_IRQ_EN_EOS   | \
                              ADC_IRQ_EN_EOC   | \
                              ADC_IRQ_EN_EODS)
#endif /* ADC_SUPPORT_AUDIO_FEATURES */
/**
  * @}
  */


/**
  * @}
  */


/* Private macro -------------------------------------------------------------*/

/** @defgroup ADC_Private_Macros ADC Private Macros
  * @{
  */
/* Macro reserved for internal HAL driver usage, not intended to be used in   */
/* code of final user.                                                        */

/**
  * @brief Clear ADC error code (set it to no error code "HAL_ADC_ERROR_NONE").
  * @param __HANDLE__ ADC handle
  * @retval None
  */
#define ADC_CLEAR_ERRORCODE(__HANDLE__) ((__HANDLE__)->ErrorCode = HAL_ADC_ERROR_NONE)

/**
  * @brief Simultaneously clear and set specific bits of the handle State.
  * @note  ADC_STATE_CLR_SET() macro is merely aliased to generic macro MODIFY_REG(),
  *        the first parameter is the ADC handle State, the second parameter is the
  *        bit field to clear, the third and last parameter is the bit field to set.
  * @retval None
  */
#define ADC_STATE_CLR_SET MODIFY_REG

/**
  * @brief Verify the length of the scheduled conversions group.
  * @param __LENGTH__ number of programmed conversions.
  * @retval SET (__LENGTH__ is within the maximum number of possible programmable conversions)
  *         or RESET (__LENGTH__ is null or too large)
  */
#define IS_ADC_NB_CONV(__LENGTH__) (((__LENGTH__) >= (1UL)) && ((__LENGTH__) <= (16UL)))

/**
  * @brief Verify the ADC data width setting.
  * @param __DATA_WIDTH__ programmed ADC resolution.
  * @retval SET (__DATA_WIDTH__ is a valid value) or RESET (__DATA_WIDTH__ is invalid)
  */
#define IS_ADC_DATAWIDTH(__DATA_WIDTH__) (((__DATA_WIDTH__) == ADC_DS_DATA_WIDTH_12_BIT) || \
                                          ((__DATA_WIDTH__) == ADC_DS_DATA_WIDTH_13_BIT) || \
                                          ((__DATA_WIDTH__) == ADC_DS_DATA_WIDTH_14_BIT) || \
                                          ((__DATA_WIDTH__) == ADC_DS_DATA_WIDTH_15_BIT) || \
                                          ((__DATA_WIDTH__) == ADC_DS_DATA_WIDTH_16_BIT)   )
/**
  * @brief Verify the ADC downsampler ratio setting.
  * @param __DATA_RATIO__ programmed ADC downsampler ratio.
  * @retval SET (__DATA_RATIO__ is a valid value) or RESET (__DATA_RATIO__ is invalid)
  */
#define IS_ADC_DATARATIO(__DATA_RATIO__) (((__DATA_RATIO__) == ADC_DS_RATIO_1)  || \
                                          ((__DATA_RATIO__) == ADC_DS_RATIO_2)  || \
                                          ((__DATA_RATIO__) == ADC_DS_RATIO_4)  || \
                                          ((__DATA_RATIO__) == ADC_DS_RATIO_8)  || \
                                          ((__DATA_RATIO__) == ADC_DS_RATIO_16) || \
                                          ((__DATA_RATIO__) == ADC_DS_RATIO_32) || \
                                          ((__DATA_RATIO__) == ADC_DS_RATIO_64) || \
                                          ((__DATA_RATIO__) == ADC_DS_RATIO_128)   )

/**
  * @brief Verify the ADC conversion type setting.
  * @param __CONVERSION_TYPE__ ADC conversion type.
  * @retval SET (__CONVERSION_TYPE__ is a valid value) or RESET (__CONVERSION_TYPE__ is invalid)
  */
#define IS_ADC_CONVERSIONTYPE(__CONVERSION_TYPE__) (((__CONVERSION_TYPE__) == ADC_CONVERSION_WITH_DS)  || \
                                                    ((__CONVERSION_TYPE__) == ADC_CONVERSION_WITH_DF)    )

/**
  * @brief Verify the ADC conversions overrun handling.
  * @param __OVR__ ADC conversions overrun handling.
  * @retval SET (__OVR__ is a valid value) or RESET (__OVR__ is invalid)
  */
#define IS_ADC_OVERRUN(__OVR__) (((__OVR__) == ADC_NEW_DATA_IS_LOST)  || \
                                 ((__OVR__) == ADC_NEW_DATA_IS_KEPT)    )

/**
  * @brief Verify the ADC sampling mode setting.
  * @param __SAMPLING_MODE__ programmed ADC sampling mode.
  * @retval SET (__SAMPLING_MODE__ is a valid value) or RESET (__SAMPLING_MODE__ is invalid)
  */
#define IS_ADC_SAMPLINGMODE(__SAMPLING_MODE__) (((__SAMPLING_MODE__) == ADC_SAMPLING_AT_START) || \
                                                ((__SAMPLING_MODE__) == ADC_SAMPLING_AT_END)     )

/**
  * @brief Verify the ADC calibration calibration point setting.
  * @param __POINT_NUMBER__ selected ADC calibration point number
  * @retval SET (__POINT_NUMBER__ is a valid value) or RESET (__POINT_NUMBER__ is invalid)
  */
#define IS_ADC_CALIBRATION_POINT(__POINT_NUMBER__) (((__POINT_NUMBER__) == ADC_CALIB_POINT_1) || \
                                                    ((__POINT_NUMBER__) == ADC_CALIB_POINT_2) || \
                                                    ((__POINT_NUMBER__) == ADC_CALIB_POINT_3) || \
                                                    ((__POINT_NUMBER__) == ADC_CALIB_POINT_4) || \
                                                    ((__POINT_NUMBER__) == ADC_CALIB_NONE)      )

/**
  * @brief Verify the ADC calibration calibration gain setting.
  * @param __GAIN__ selected ADC calibration gain
  * @retval SET (__GAIN__ is a valid value) or RESET (__GAIN__ is invalid)
  */
#define IS_ADC_CALIBRATION_GAIN(__GAIN__) ((__GAIN__ <= 0xFFFUL))

/**
  * @brief Verify the ADC calibration calibration offset setting.
  * @param __OFFSET__ selected ADC calibration offset
  * @retval SET (__OFFSET__ is a valid value) or RESET (__OFFSET__ is invalid)
  */
#define IS_ADC_CALIBRATION_OFFSET(__OFFSET__) ((__OFFSET__ <= 0xFFUL))

/**
  * @brief Verify the ADC conversions sampling time.
  * @param __SAMPLERATE__ ADC conversions sampling time.
  * @retval SET (__SAMPLING_TIME__ is a valid value) or RESET (__SAMPLING_TIME__ is invalid)
  */
#if defined(ADC_CONF_SAMPLE_RATE_MSB)
#define IS_ADC_SAMPLERATE(__SAMPLERATE__)    (((__SAMPLERATE__) == ADC_SAMPLE_RATE_16)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_20)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_24)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_28)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_32)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_36)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_40)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_44)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_48)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_52)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_56)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_60)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_64)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_68)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_72)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_76)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_80)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_84)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_88)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_92)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_96)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_100) || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_104) || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_108) || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_112) || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_116) || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_120) || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_124) || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_128) || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_132) || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_136) || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_140)  )
#else
#define IS_ADC_SAMPLERATE(__SAMPLERATE__)    (((__SAMPLERATE__) == ADC_SAMPLE_RATE_16)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_20)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_24)  || \
                                              ((__SAMPLERATE__) == ADC_SAMPLE_RATE_28)   )
#endif /* ADC_CONF_SAMPLE_RATE_MSB */

/**
  * @brief Verify the ADC bit inversion mode
  * @param  __OUTBIT_MODE__ ADC invert bit to bit data output.
  * @retval SET (__OUTBIT_MODE__ is valid) or RESET (__OUTBIT_MODE__ is invalid)
  */
#define IS_ADC_DATA_INVERT(__OUTBIT_MODE__)   (((__OUTBIT_MODE__) == ADC_DATA_INVERT_NONE) || \
                                               ((__OUTBIT_MODE__) == ADC_DATA_INVERT_DIFF) || \
                                               ((__OUTBIT_MODE__) == ADC_DATA_INVERT_SING) || \
                                               ((__OUTBIT_MODE__) == ADC_DATA_INVERT_BOTH)  )

/**
  * @brief Verify the ADC sequencer rank setting.
  * @param  __RANK__ selected position in sequencer.
  * @retval SET (__RANK__ is valid) or RESET (__RANK__ is invalid)
  */
#define IS_ADC_RANK(__RANK__) (((__RANK__) == ADC_RANK_1 ) || \
                               ((__RANK__) == ADC_RANK_2 ) || \
                               ((__RANK__) == ADC_RANK_3 ) || \
                               ((__RANK__) == ADC_RANK_4 ) || \
                               ((__RANK__) == ADC_RANK_5 ) || \
                               ((__RANK__) == ADC_RANK_6 ) || \
                               ((__RANK__) == ADC_RANK_7 ) || \
                               ((__RANK__) == ADC_RANK_8 ) || \
                               ((__RANK__) == ADC_RANK_9 ) || \
                               ((__RANK__) == ADC_RANK_10) || \
                               ((__RANK__) == ADC_RANK_11) || \
                               ((__RANK__) == ADC_RANK_12) || \
                               ((__RANK__) == ADC_RANK_13) || \
                               ((__RANK__) == ADC_RANK_14) || \
                               ((__RANK__) == ADC_RANK_15) || \
                               ((__RANK__) == ADC_RANK_16)   )

/**
  * @brief Verify the ADC channel voltage range setting.
  * @param  __VOLTAGE_RANGE__ selected voltage range.
  * @retval SET (__VOLTAGE_RANGE_ is valid) or RESET (__VOLTAGE_RANGE_ is invalid)
  */
#define IS_ADC_VOLTAGE_RANGE(__VOLTAGE_RANGE__) (((__VOLTAGE_RANGE__) == ADC_VIN_RANGE_1V2) || \
                                                 ((__VOLTAGE_RANGE__) == ADC_VIN_RANGE_2V4) || \
                                                 ((__VOLTAGE_RANGE__) == ADC_VIN_RANGE_3V6)   )

/**
  * @brief Verify the ADC channel setting.
  * @param  __CHANNEL__ selected ADC channel.
  * @retval SET (__CHANNEL__ is valid) or RESET (__CHANNEL__ is invalid)
  */
#define IS_ADC_CHANNEL(__CHANNEL__) (((__CHANNEL__) == ADC_CHANNEL_VINM0)       || \
                                     ((__CHANNEL__) == ADC_CHANNEL_VINM1)       || \
                                     ((__CHANNEL__) == ADC_CHANNEL_VINM2)       || \
                                     ((__CHANNEL__) == ADC_CHANNEL_VINM3)       || \
                                     ((__CHANNEL__) == ADC_CHANNEL_VINP0)       || \
                                     ((__CHANNEL__) == ADC_CHANNEL_VINP1)       || \
                                     ((__CHANNEL__) == ADC_CHANNEL_VINP2)       || \
                                     ((__CHANNEL__) == ADC_CHANNEL_VINP3)       || \
                                     ((__CHANNEL__) == ADC_CHANNEL_VINP0_VINM0) || \
                                     ((__CHANNEL__) == ADC_CHANNEL_VINP1_VINM1) || \
                                     ((__CHANNEL__) == ADC_CHANNEL_VINP2_VINM2) || \
                                     ((__CHANNEL__) == ADC_CHANNEL_VINP3_VINM3) || \
                                     ((__CHANNEL__) == ADC_CHANNEL_VBAT)        || \
                                     ((__CHANNEL__) == ADC_CHANNEL_TEMPSENSOR)    )

#if defined(ADC_SUPPORT_AUDIO_FEATURES)
/**
  * @brief Verify the ADC event setting.
  * @param  __EVENT__ ADC event.
  * @retval SET (__EVENT__ is valid) or RESET (__EVENT__ is invalid)
  */
#define IS_ADC_EVENT_TYPE(__EVENT__) (((__EVENT__) == ADC_IRQ_FLAG_OVRFL) || \
                                      ((__EVENT__) == ADC_IRQ_FLAG_OVRDF) || \
                                      ((__EVENT__) == ADC_IRQ_FLAG_OVRDS) || \
                                      ((__EVENT__) == ADC_IRQ_FLAG_AWD1)  || \
                                      ((__EVENT__) == ADC_IRQ_FLAG_EOS)   || \
                                      ((__EVENT__) == ADC_IRQ_FLAG_EODF)  || \
                                      ((__EVENT__) == ADC_IRQ_FLAG_EODS)    )
#else
/**
  * @brief Verify the ADC event setting.
  * @param  __EVENT__ ADC event.
  * @retval SET (__EVENT__ is valid) or RESET (__EVENT__ is invalid)
  */
#define IS_ADC_EVENT_TYPE(__EVENT__) (((__EVENT__) == ADC_IRQ_FLAG_OVRDS) || \
                                      ((__EVENT__) == ADC_IRQ_FLAG_AWD1)  || \
                                      ((__EVENT__) == ADC_IRQ_FLAG_EOS)   || \
                                      ((__EVENT__) == ADC_IRQ_FLAG_EODS)    )
#endif /* ADC_SUPPORT_AUDIO_FEATURES */

/**
  * @brief Verify the ADC watchdog channel setting.
  * @param  __CHANNEL__ ADC channel selection monitored by watchdog.
  * @retval SET (__CHANNEL__ is valid) or RESET (__CHANNEL__ is invalid)
  */
#define IS_ADC_AWD_CHANNEL(__CHANNEL__) \
  (((__CHANNEL__) != 0UL)  \
   && (((__CHANNEL__) & ~(ADC_AWD_CH_VINM0   | ADC_AWD_CH_VINM1   | ADC_AWD_CH_VINM2    | ADC_AWD_CH_VINM3      | \
                          ADC_AWD_CH_VINP0   | ADC_AWD_CH_VINP1   | ADC_AWD_CH_VINP2    | ADC_AWD_CH_VINP3      | \
                          ADC_AWD_CH_MICROM  | ADC_AWD_CH_MICROP  | ADC_AWD_CH_VBAT     | ADC_AWD_CH_TEMPSENSOR | \
                          ADC_AWD_CH_GND_NEG | ADC_AWD_CH_GND_POS | ADC_AWD_CH_VDDA_NEG | ADC_AWD_CH_VDDA_POS ))  \
       == 0UL))

/**
  * @brief Verify the ADC watchdog event setting.
  * @param  __EVENT__ ADC watchdog event.
  * @retval SET (__EVENT__ is valid) or RESET (__EVENT__ is invalid)
  */
#define IS_ADC_AWD_EVENT_TYPE(__EVENT__) (((__EVENT__) == ADC_AWD_EVENT_POLLING) || \
                                          ((__EVENT__) == ADC_AWD_EVENT_INTERRUPT) )

#if defined(ADC_SUPPORT_AUDIO_FEATURES)
/**
  * @brief Verify the ADC Decimation filter dynamic range setting.
  * @param  __RANGE__ Decimation filter selected dynamic range.
  * @retval SET (__RANGE__ is valid) or RESET (__RANGE__ is invalid)
  */
#define IS_ADC_DF_DYNAMIC_RANGE(__RANGE__) (((__RANGE__) == ADC_DF_DYN_RANGE_FULL) || \
                                            ((__RANGE__) == ADC_DF_DYN_RANGE_HALF) )

/**
  * @brief Verify the ADC Decimation filter data format setting.
  * @param  __SIGN__ Selected data sign.
  * @retval SET (__SIGN__ is valid) or RESET (__SIGN__ is invalid)
  */
#define IS_ADC_DF_DATA_FORMAT(__SIGN__) (((__SIGN__) == ADC_DF_DATA_FORMAT_SIGNED) || \
                                         ((__SIGN__) == ADC_DF_DATA_FORMAT_UNSIGNED) )

/**
  * @brief Verify the ADC Decimation filter CIC Filter factor format setting.
  * @param  __FACTOR__ Selected Decimation filter CIC Filter factor format.
  * @retval SET (__FACTOR__ is valid) or RESET (__FACTOR__ is invalid)
  */
#define IS_ADC_DF_CIC_DECIMATOR_HALF_FACTOR(__FACTOR__) (((__FACTOR__) == ADC_DF_CIC_DECIMATOR_FACTOR_HALF) || \
                                                         ((__FACTOR__) == ADC_DF_CIC_DECIMATOR_FACTOR_INTEGER) )

/**
  * @brief Verify the ADC Decimation filter CIC Filter factor setting.
  * @param  __FACTOR__ Selected CIC Filter factor.
  * @retval SET (__FACTOR__ is valid) or RESET (__FACTOR__ is invalid)
  */
#define IS_ADC_DF_CIC_DECIMATOR_FACTOR(__FACTOR__) ((__FACTOR__) <= 0x3FUL)

/**
  * @brief Verify the ADC Decimation filter microphone channel setting.
  * @param  __CHANNEL__ ADC microphone channel.
  * @retval SET (__CHANNEL__ is valid) or RESET (__CHANNEL__ is invalid)
  */
#define IS_ADC_DF_MICROPHONE_CHANNEL(__CHANNEL__) (((__CHANNEL__) == ADC_DF_MIC_CH_LEFT) || \
                                                   ((__CHANNEL__) == ADC_DF_MIC_CH_RIGHT)  )

/**
  * @brief Verify the ADC PDM clock divider setting.
  * @param  __CLOCK_DIV__  ADC PDM clock divider.
  * @retval SET (__CLOCK_DIV__ is valid) or RESET (__CLOCK_DIV__ is invalid)
  */
#define IS_ADC_PDM_CLOCK_DIVIDER(__CLOCK_DIV__) (((__CLOCK_DIV__) == ADC_PDM_DIV_10) || \
                                                 ((__CLOCK_DIV__) == ADC_PDM_DIV_11) || \
                                                 ((__CLOCK_DIV__) == ADC_PDM_DIV_12) || \
                                                 ((__CLOCK_DIV__) == ADC_PDM_DIV_13) || \
                                                 ((__CLOCK_DIV__) == ADC_PDM_DIV_14) || \
                                                 ((__CLOCK_DIV__) == ADC_PDM_DIV_15) || \
                                                 ((__CLOCK_DIV__) == ADC_PDM_DIV_16) || \
                                                 ((__CLOCK_DIV__) == ADC_PDM_DIV_17) || \
                                                 ((__CLOCK_DIV__) == ADC_PDM_DIV_18) || \
                                                 ((__CLOCK_DIV__) == ADC_PDM_DIV_19) || \
                                                 ((__CLOCK_DIV__) == ADC_PDM_DIV_20) || \
                                                 ((__CLOCK_DIV__) == ADC_PDM_DIV_21) || \
                                                 ((__CLOCK_DIV__) == ADC_PDM_DIV_22) || \
                                                 ((__CLOCK_DIV__) == ADC_PDM_DIV_23) || \
                                                 ((__CLOCK_DIV__) == ADC_PDM_DIV_24) || \
                                                 ((__CLOCK_DIV__) == ADC_PDM_DIV_25)   )

/**
  * @brief Verify the ADC Programmable Gain Amplifier voltage bias setting.
  * @param  __BIAS__  ADC PGA voltage bias.
  * @retval SET (__BIAS__ is valid) or RESET (__BIAS__ is invalid)
  */
#define IS_ADC_PGA_BIAS(__BIAS__) (((__BIAS__) == ADC_PGA_BIAS_050_BAT) || \
                                   ((__BIAS__) == ADC_PGA_BIAS_055_BAT) || \
                                   ((__BIAS__) == ADC_PGA_BIAS_060_BAT) || \
                                   ((__BIAS__) == ADC_PGA_BIAS_065_BAT) || \
                                   ((__BIAS__) == ADC_PGA_BIAS_070_BAT) || \
                                   ((__BIAS__) == ADC_PGA_BIAS_075_BAT) || \
                                   ((__BIAS__) == ADC_PGA_BIAS_080_BAT) || \
                                   ((__BIAS__) == ADC_PGA_BIAS_090_BAT)   )

/**
  * @brief Verify the ADC Programmable Gain Amplifier gain setting.
  * @param  __GAIN__  ADC PGA gain.
  * @retval SET (__GAIN__ is valid) or RESET (__GAIN__ is invalid)
  */
#define IS_ADC_PGA_GAIN(__GAIN__) (((__GAIN__) == ADC_PGA_GAIN_06_DB) || \
                                   ((__GAIN__) == ADC_PGA_GAIN_09_DB) || \
                                   ((__GAIN__) == ADC_PGA_GAIN_12_DB) || \
                                   ((__GAIN__) == ADC_PGA_GAIN_15_DB) || \
                                   ((__GAIN__) == ADC_PGA_GAIN_18_DB) || \
                                   ((__GAIN__) == ADC_PGA_GAIN_21_DB) || \
                                   ((__GAIN__) == ADC_PGA_GAIN_24_DB) || \
                                   ((__GAIN__) == ADC_PGA_GAIN_27_DB) || \
                                   ((__GAIN__) == ADC_PGA_GAIN_30_DB)   )

/**
  * @brief Verify the ADC Occasional mode source channel setting.
  * @param  __CHANNEL__  selected ADC Occasional mode source channel.
  * @retval SET (__CHANNEL__ is valid) or RESET (__CHANNEL__ is invalid)
  */
#define IS_ADC_OCM_SOURCE(__CHANNEL__) (((__CHANNEL__) == ADC_OCM_SRC_VBAT) || \
                                        ((__CHANNEL__) == ADC_OCM_SRC_TEMP)   )

/**
  * @brief Verify the Programmable Gain Amplifier voltage bias precharge delay.
  * @param  __DELAY__  ADC PGA voltage bias precharge delay (microseconds).
  * @retval SET (__DELAY__ is valid) or RESET (__DELAY__ is invalid)
  */
#define IS_ADC_PGA_VBIAS_PRECHARGE_DELAY(__DELAY__) ((__DELAY__) <= 1044480UL)
#endif /* ADC_SUPPORT_AUDIO_FEATURES */

/**
  * @brief Verify the LDO stabilization delay.
  * @param  __DELAY__  LDO stabilization delay (microseconds).
  * @retval SET (__DELAY__ is valid) or RESET (__DELAY__ is invalid)
  */
#define IS_ADC_LDO_DELAY(__DELAY__) ((__DELAY__) <= 1020UL)

/**
  * @}
  */


/* Private constants ---------------------------------------------------------*/

